src/Documents/РасходованиеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>РасходованиеДенежныхСредств</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УчетФинансовОбороты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокументаПлан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокументаФакт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРасходованийДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Расходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДвиженияДенежныхСредств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФакт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/РасходованиеДенежныхСредств/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьДельтуСуммДокумента();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура МесяцПриИзменении(Элемент)
	
	МесяцПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти
 
#Область ОбработчикиСобытийЭлементовТаблицыФормыРасходы

&НаКлиенте
Процедура РасходыСуммаПланПриИзменении(Элемент)
	РасходыСуммаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РасходыСуммаФактПриИзменении(Элемент)
	РасходыСуммаФактПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СкорректироватьДаты(Команда)
	
	СкорректироватьДатыНаСервере();
	
КонецПроцедуры
 
&НаКлиенте
Процедура ЗаполнитьЕжедневнымиТратами(Команда)
	ЗаполнитьЕжедневнымиТратамиНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
 
&НаСервере
Процедура ЗаполнитьЕжедневнымиТратамиНаСервере()
	
	Объект.Расходы.Очистить();
	СуммаВДень = Константы.РасходыНаПроживаниеВДень.Получить();
	ДатаНачала = НачалоМесяца(Объект.Месяц);
	ДатаЗавершения = КонецМесяца(Объект.Месяц);
	ДатаВТаблицу = ДатаНачала;
	СекундВДне = 24*60*60;
	Пока ДатаВТаблицу <= ДатаЗавершения Цикл
		СтрокаРасхода = ОБъект.Расходы.Добавить();
		СтрокаРасхода.Дата = ДатаВТаблицу;
		СтрокаРасхода.СтатьяДвиженияДенежныхСредств = Справочники.СтатьиДвиженияДенежныхСредств.ЕжедневныеРасходыНаПроживание;
		СтрокаРасхода.СуммаПлан = СуммаВДень;
		ДатаВТаблицу = ДатаВТаблицу + СекундВДне;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура МесяцПриИзмененииНаСервере()
	
	СкорректироватьДатыНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СкорректироватьДатыНаСервере()
	
	ДанныеОбъекта = РеквизитФормыВЗначение("Объект");
	ЗаполнениеДокументовВызовСервера.СкорректироватьДатыНаСервере(Объект.Месяц, ДанныеОбъекта.Расходы, Модифицированность);
	ЗначениеВРеквизитФормы(ДанныеОбъекта, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура РасходыСуммаФактПриИзмененииНаСервере()
	
	Объект.СуммаДокументаФакт = Объект.Расходы.Итог("СуммаФакт");
	ОбновитьДельтуСуммДокумента();
	
КонецПроцедуры

&НаСервере
Процедура РасходыСуммаПриИзмененииНаСервере()
	
	Объект.СуммаДокументаПлан = Объект.Расходы.Итог("СуммаПлан");
	ОбновитьДельтуСуммДокумента();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДельтуСуммДокумента()
	
	ДельтаПланФакт = Объект.СуммаДокументаПлан - Объект.СуммаДокументаФакт;
	
КонецПроцедуры

#КонецОбласти
